{
  "activation_function": "gelu",
  "alpha": 0.5,
  "bos_token_id": 49406,
  "co_weight": 1,
  "count_similarity": true,
  "d_align": 128,
  "d_ffn": 2048,
  "d_model": 512,
  "d_vision": 1024,
  "do_sample": true,
  "dropout": 0.1,
  "droppath": 0.1,
  "eos_token_id": 49407,
  "init_std": 0.02,
  "is_encoder_decoder": true,
  "label_smoothing": 0.1,
  "lm_dropout": 0.5,
  "ln_eps": 1e-06,
  "max_positions": 64,
  "model_type": "conica",
  "momentum": 0.995,
  "multimodal_decoder_layers": 3,
  "n_head": 8,
  "output_hidden_states": true,
  "output_scores": true,
  "pad_token_id": 49407,
  "position_type": "sinusoid",
  "pre_norm": false,
  "queue_size": 8192,
  "return_dict_in_generate": true,
  "seq_per_img": 5,
  "tau": 0.07,
  "text_encoder_layers": 3,
  "top_k": 0,
  "transformers_version": "4.29.1",
  "use_cache": true,
  "vision_dropout": 0.1,
  "vision_encoder_layers": 6,
  "vision_global_pool": true,
  "vocab_size": 49408,
  "xe_weight": 1
}
